app/views/links/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id, 'Category' %><br />
    <%= f.select :category_id, Category.all.collect {|c| c.id.to_s+' '+c.name }  %>